from . import _register

_register({
    # 用户信息
    "联觉等级": {
        "cht": "聯覺等級",
        "en": "Union Level",
        "jp": "ユニオンレベル",
        "kr": "연각 레벨",
    },
    "索拉等阶": {
        "cht": "索拉等階",
        "en": "SOL3 Phase",
        "jp": "ソラランク",
        "kr": "솔라리스 랭크",
    },
    # 声骸评分区
    "声骸评级": {
        "cht": "聲骸評級",
        "en": "Echo Rating",
        "jp": "音骸レーティング",
        "kr": "음해 등급",
    },
    "声骸评分": {
        "cht": "聲骸評分",
        "en": "Echo Score",
        "jp": "音骸スコア",
        "kr": "음해 점수",
    },
    "暂无": {
        "cht": "暫無",
        "en": "N/A",
        "jp": "なし",
        "kr": "없음",
    },
    "分": {
        "cht": "分",
        "en": "pts",
        "jp": "点",
        "kr": "점",
    },
    "[提示]评分模板": {
        "cht": "[提示]評分模板",
        "en": "[Tip] Score Template",
        "jp": "[ヒント]スコアテンプレート",
        "kr": "[팁] 채점 템플릿",
    },
    # 伤害区
    "伤害类型": {
        "cht": "傷害類型",
        "en": "DMG Type",
        "jp": "ダメージ種別",
        "kr": "피해 유형",
    },
    "暴击伤害": {
        "cht": "暴擊傷害",
        "en": "Crit. DMG",
        "jp": "クリティカルダメージ",
        "kr": "크리티컬 피해",
    },
    "期望伤害": {
        "cht": "期望傷害",
        "en": "Expected DMG",
        "jp": "期待ダメージ",
        "kr": "기대 피해",
    },
    "buff列表": {
        "cht": "buff列表",
        "en": "Buff List",
        "jp": "バフ一覧",
        "kr": "버프 목록",
    },
    # 排名
    "评分排名": {
        "cht": "評分排名",
        "en": "Score Rank",
        "jp": "スコア順位",
        "kr": "점수 순위",
    },
    "估计评分排名": {
        "cht": "估計評分排名",
        "en": "Est. Score Rank",
        "jp": "推定スコア順位",
        "kr": "예상 점수 순위",
    },
    "伤害排名": {
        "cht": "傷害排名",
        "en": "DMG Rank",
        "jp": "ダメージ順位",
        "kr": "피해 순위",
    },
    "估计伤害排名": {
        "cht": "估計傷害排名",
        "en": "Est. DMG Rank",
        "jp": "推定ダメージ順位",
        "kr": "예상 피해 순위",
    },
    # 武器
    "精": {
        "cht": "諧",
        "en": "S",
        "jp": "調",
        "kr": "공",
    },
})
